# Загрузка данных

In [1]:
import pandas as pd
import json

orig_data = pd.read_csv("../2/melbourne_housing.csv")
display(orig_data, orig_data.dtypes, orig_data.isnull().sum())

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,NaN,SS,Jellis,3/09/2016,2.5,3067.0,...,1.0,1.0,126.0,NaN,NaN,Yarra City Council,-37.80140,144.99580,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra City Council,-37.79960,144.99840,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra City Council,-37.80790,144.99340,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,NaN,VB,Rounds,4/02/2016,2.5,3067.0,...,2.0,1.0,0.0,NaN,NaN,Yarra City Council,-37.81140,145.01160,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra City Council,-37.80930,144.99440,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
34852,Yarraville,13 Burns St,4,h,1480000.0,PI,Jas,24/02/2018,6.3,3013.0,...,1.0,3.0,593.0,NaN,NaN,Maribyrnong City Council,-37.81053,144.88467,Western Metropolitan,6543.0
34853,Yarraville,29A Murray St,2,h,888000.0,SP,Sweeney,24/02/2018,6.3,3013.0,...,2.0,1.0,98.0,104.0,2018.0,Maribyrnong City Council,-37.81551,144.88826,Western Metropolitan,6543.0
34854,Yarraville,147A Severn St,2,t,705000.0,S,Jas,24/02/2018,6.3,3013.0,...,1.0,2.0,220.0,120.0,2000.0,Maribyrnong City Council,-37.82286,144.87856,Western Metropolitan,6543.0
34855,Yarraville,12/37 Stephen St,3,h,1140000.0,SP,hockingstuart,24/02/2018,6.3,3013.0,...,NaN,NaN,NaN,NaN,NaN,Maribyrnong City Council,NaN,NaN,Western Metropolitan,6543.0
34856,Yarraville,3 Tarrengower St,2,h,1020000.0,PI,RW,24/02/2018,6.3,3013.0,...,1.0,0.0,250.0,103.0,1930.0,Maribyrnong City Council,-37.81810,144.89351,Western Metropolitan,6543.0

Suburb            object
Address           object
Rooms              int64
Type              object
Price            float64
Method            object
SellerG           object
Date              object
Distance         float64
Postcode         float64
Bedroom2         float64
Bathroom         float64
Car              float64
Landsize         float64
BuildingArea     float64
YearBuilt        float64
CouncilArea       object
Lattitude        float64
Longtitude       float64
Regionname        object
Propertycount    float64
dtype: object

Suburb               0
Address              0
Rooms                0
Type                 0
Price             7610
Method               0
SellerG              0
Date                 0
Distance             1
Postcode             1
Bedroom2          8217
Bathroom          8226
Car               8728
Landsize         11810
BuildingArea     21115
YearBuilt        19306
CouncilArea          3
Lattitude         7976
Longtitude        7976
Regionname           3
Propertycount        3
dtype: int64

In [2]:
import numpy as np

data = orig_data[["Type", "Rooms", "Price", "Distance", "Postcode", "Bedroom2", "Bathroom"]].dropna(axis=0, how='any')
data = data.astype({ x: np.int64 for x in data.columns if x not in [ "Type" ] })

display(data, data.dtypes)

      Type  Rooms    Price  Distance  Postcode  Bedroom2  Bathroom
1        h      2  1480000         2      3067         2         1
2        h      2  1035000         2      3067         2         1
4        h      3  1465000         2      3067         3         2
5        h      3   850000         2      3067         3         2
6        h      4  1600000         2      3067         3         1
...    ...    ...      ...       ...       ...       ...       ...
34851    h      3  1101000         6      3013         3         1
34852    h      4  1480000         6      3013         4         1
34853    h      2   888000         6      3013         2         2
34854    t      2   705000         6      3013         2         1
34856    h      2  1020000         6      3013         2         1

[20800 rows x 7 columns]

Type        object
Rooms        int64
Price        int64
Distance     int64
Postcode     int64
Bedroom2     int64
Bathroom     int64
dtype: object

In [3]:
data["Type"].unique()

array(['h', 'u', 't'], dtype=object)

In [4]:
from sklearn.preprocessing import LabelEncoder

type_encoder = LabelEncoder()
data["Type"] = type_encoder.fit_transform(data["Type"])

display(data)
display(type_encoder.classes_)

       Type  Rooms    Price  Distance  Postcode  Bedroom2  Bathroom
1         0      2  1480000         2      3067         2         1
2         0      2  1035000         2      3067         2         1
4         0      3  1465000         2      3067         3         2
5         0      3   850000         2      3067         3         2
6         0      4  1600000         2      3067         3         1
...     ...    ...      ...       ...       ...       ...       ...
34851     0      3  1101000         6      3013         3         1
34852     0      4  1480000         6      3013         4         1
34853     0      2   888000         6      3013         2         2
34854     1      2   705000         6      3013         2         1
34856     0      2  1020000         6      3013         2         1

[20800 rows x 7 columns]

array(['h', 't', 'u'], dtype=object)

# Разделите выборки на обучающую и тестовую

In [5]:
data_X = data.drop(columns=["Price"])
data_Y = data["Price"]

display(data_X, data_Y)

       Type  Rooms  Distance  Postcode  Bedroom2  Bathroom
1         0      2         2      3067         2         1
2         0      2         2      3067         2         1
4         0      3         2      3067         3         2
5         0      3         2      3067         3         2
6         0      4         2      3067         3         1
...     ...    ...       ...       ...       ...       ...
34851     0      3         6      3013         3         1
34852     0      4         6      3013         4         1
34853     0      2         6      3013         2         2
34854     1      2         6      3013         2         1
34856     0      2         6      3013         2         1

[20800 rows x 6 columns]

1        1480000
2        1035000
4        1465000
5         850000
6        1600000
          ...
34851    1101000
34852    1480000
34853     888000
34854     705000
34856    1020000
Name: Price, Length: 20800, dtype: int64

In [6]:
from sklearn.model_selection import train_test_split

i_train, i_test, o_train, o_test = train_test_split(data_X, data_Y, test_size=0.3, random_state=1)
display(i_train, o_train)
display(i_test, o_test)

       Type  Rooms  Distance  Postcode  Bedroom2  Bathroom
4237      0      2         1      3065         2         1
5593      0      5         7      3079         4         2
9269      0      3         3      3141         3         2
3730      0      4        10      3084         3         2
17854     0      2         6      3143         2         1
...     ...    ...       ...       ...       ...       ...
17905     2      3        10      3186         3         1
27744     0      5         7      3040         5         3
8584      1      2        11      3073         3         1
19637     0      4        12      3073         4         1
390       0      5         6      3143         8         2

[14560 rows x 6 columns]

4237     1300000
5593     1730000
9269     2695000
3730     2600000
17854    1480000
          ...
17905    1296000
27744    1560000
8584      490000
19637     905000
390      1525000
Name: Price, Length: 14560, dtype: int64

       Type  Rooms  Distance  Postcode  Bedroom2  Bathroom
29561     0      4        20      3059         4         3
11168     0      2         1      3053         2         1
34077     0      3         7      3124         3         2
9025      2      2        11      3084         2         1
11556     0      5        12      3083         5         2
...     ...    ...       ...       ...       ...       ...
5308      2      2         4      3122         2         1
4995      2      2        13      3188         2         1
25145     0      4        18      3029         4         2
1941      0      3        11      3186         3         2
22155     0      3        27      3024         3         2

[6240 rows x 6 columns]

29561     679000
11168    1117000
34077    1550000
9025      635000
11556    1000000
          ...
5308      663000
4995      895000
25145     580000
1941     1600000
22155     475000
Name: Price, Length: 6240, dtype: int64

# Модель ближайших соседей

In [7]:
from sklearn.neighbors import KNeighborsRegressor
from sklearn.metrics import r2_score

reg1 = KNeighborsRegressor(n_neighbors=5)
reg1.fit(i_train, o_train)
r2_score(o_train, reg1.predict(i_train)), r2_score(o_test, reg1.predict(i_test))

(0.7626388053776699, 0.7091644437134044)

In [8]:
from sklearn.model_selection import cross_val_score
scores = cross_val_score(reg1, data_X, data_Y, cv=4)
scores, np.mean(scores)

(array([0.63693259, 0.66049393, 0.66720708, 0.69694129]), 0.6653937203148237)

In [9]:
from sklearn.model_selection import GridSearchCV, RepeatedKFold

grid = GridSearchCV(
  estimator=KNeighborsRegressor(),
  param_grid={
    "n_neighbors": range(1, 50, 1)
  },
  cv=RepeatedKFold(n_splits=3, n_repeats=3),
  scoring="r2",
)

grid.fit(data_X, data_Y)
grid.best_score_, grid.best_params_, grid.best_estimator_

(0.7102638528755844, {'n_neighbors': 10}, KNeighborsRegressor(n_neighbors=10))

In [10]:
grid.best_estimator_.fit(i_train, o_train)
r2_score(o_train, grid.best_estimator_.predict(i_train)), r2_score(o_test, grid.best_estimator_.predict(i_test))

(0.7541344860569129, 0.7276936893702255)

In [11]:
scores = cross_val_score(grid.best_estimator_, data_X, data_Y, cv=RepeatedKFold(n_splits=3, n_repeats=3))
print("%0.2f r^2 with a standard deviation of %0.2f" % (scores.mean(), scores.std()))

0.71 r^2 with a standard deviation of 0.01